controllers/admin/UserController.php

INSERT INTO `user` (`first_name`, `last_name`, `email`, `password`) VALUES ('erter', 'tertret', 'ertert@mail.ru', '$2y$13$QmLwDHOIDfpHfrTQWug5ouggeSyZuYs.iszt0juZAxPyBkEjVHygW')
---
    public function actionRecord($id=null){
        if($id){
            $user = User::findOne($id);
        }else{
            $user = new User();
        }


        if($user->load(Yii::$app->request->post())){
            $user->save();