models/User.php

    public static function findIdentity($id)
    {
        return self::findOne($id);
---
SELECT * FROM `user` WHERE `id`=4